[{"date":1550707200,"expirydate":-62135596800,"objectID":"d41d8cd98f00b204e9800998ecf8427e","permalink":"/","publishdate":"0001-01-01T00:00:00Z","summary":"","title":"Ángela Castillo-Gill"},{"date":-62135596800,"expirydate":-62135596800,"objectID":"5fd7ddd1047983500df87840bde5a564","permalink":"/about/","publishdate":"0001-01-01T00:00:00Z","summary":"Hi! I’m Ángela.","title":"About"},{"categories":[],"date":1533600000,"description":"In this post I analyse 671,205 Kiva loans from around the world. I find that single female is the gender that requests the most loans. The main uses for Kiva loans are agriculture, retail, and food with some variations amongst regions. Half of the loans are 4.22 USD or less and are funded by 12 or less contributers. The median time between posting on the Kiva platform and disbursing it to the borrower is 16.89 days. I mainly use the tidyverse, stringr, and quantmode packages.","expirydate":-62135596800,"objectID":"41429b3fa65e9e188171ee8bdc0f02eb","permalink":"/2018/08/exploring-kiva-loans/","publishdate":"2018-08-07T00:00:00Z","summary":"1 Summary 2 Purpose of this post 3 The data 4 Data cleaning 5 Exploratory data analysis 5.1 Borrower gender by region 5.2 Repayment interval by region 5.3 Loan use by region  6 Techniques used 7 Questions from this analysis   1 Summary To see the code used in this post, visit my kernel on kaggle in R Markdown format.\n Objectives: To visualise a dataset and understand its main trends.","tags":["Kaggle","Kiva","End-to-end","Exploratory data analysis"],"title":"Exploring Kiva loans"},{"categories":[],"date":1533772800,"description":"In this post I explore a property dataset from Ames, Iowa. The data describes a set of features for houses and includes sales price. My goal was to understand what features are linked with sales price for this specific dataset using regression trees. To do this, I first prepared the data by dealing with missing values and created other variables to better interpet the results. After preparing the data, I used regression trees to answer the question. One of the benefits of regression trees is that the output can be illustrated and easily interpreted. I found that the variable: overall quality is most closely linked to sales price. Other features such as living area and basement size are also important. I also found that neighborhoods NorthRidge Heights, Northridge and, Stone Brook have the most expensive houses.","expirydate":-62135596800,"objectID":"58b1c36adbb58e860f9c6ec655a1a5a5","permalink":"/2018/08/regression-trees-predicting-property-prices/","publishdate":"2018-08-09T00:00:00Z","summary":"1 Summary 2 Question 3 Dataset description 3.1 Missing values 3.2 Correlation  4 Regression trees - why use them? 4.1 Variable importance  5 Results 6 Conclusion   1 Summary To see the all the code used in this post, visit my GitHub repository for this site\n Objectives: To predict property prices using decision trees, specifically, the classification and regression algorithm. Challenge: First time applying decision trees.","tags":["Kaggle","Home sales prices","Decision trees","Regression trees"],"title":"Regression trees: predicting property prices"},{"categories":[],"date":1539734400,"description":"I do perform two types of clustering on the Kaggle cereals dataset.","expirydate":-62135596800,"objectID":"80d9adefbaa7447d144a916b455cc419","permalink":"/2018/10/cluster-analysis-cereals/","publishdate":"2018-10-17T00:00:00Z","summary":"1 Summary 2 Question 3 Dataset description 4 Hierarchical clustering 5 Results 6 Conclusion   1 Summary To see the all the code used in this post, visit my GitHub repository for this site\n Objectives: To find what what kind of clusters are there in the cereals dataset available on Kaggle. Challenge: To implement a clustering algorithm for the first time. Data points: 1232 Language: R   2 Question What types of clusters are there in the cereals dataset?","tags":["Cluster analysis","Hierarchical clustering"],"title":"Clustering: cereals, supermarket shelves, and sugar"},{"categories":[],"date":1541030400,"description":"In this blogpost I analysed a dataset containing downloads of the R software in one year, spanning from October 2017 to 2018. Unsurprisingly, I found that large countries have the most total downloads. I then decide to explore downloads per 1,000 capita and find that small, developed countries around the world have the most downloads. Finally, I look into which the times of the year are most common for downloading R. I find that almost everywhere, the summer isn't a very popular season for R downloads.","expirydate":-62135596800,"objectID":"e26e0ee8d421f0c3514f7c2d5da6cc8a","permalink":"/2018/11/r-downloads-around-the-world/","publishdate":"2018-11-01T00:00:00Z","summary":"1 Summary 2 Question 3 Dataset description 3.1 Total R Downloads 3.2 Total R Downloads per 1,000 capita 3.3 Times of the year with most downloads  4 Conclusion   1 Summary To see the code used in this post, visit my kernel on kaggle in R Markdown format.\n Objectives: To spatially visualise a dataset to understand global trends. Challenge: Using the tmap package. Data points: 7,282,808 Language: R   2 Question What countries download R the most?","tags":["Kaggle","Tidy Tuesday","EDA","Maps"],"title":"Maps: R-Downloads around the world"},{"categories":[],"date":1543622400,"description":"In this blog post, I set out to explain the relationship between the education index and R downloads per 1,000 capita across the globe. To do this, I identified an education based metric for all countries. I then regressed R downloads per 1,000 capita onto the education index. I found that the education index (values from 2016) explains about 64.6% of variation in R downloads per 1,000 capita. There were several outliers including Turkmenistan, Tajikistan, Libya, Burkina Faso, and Chad.","expirydate":-62135596800,"objectID":"029c99bc865a29da245e2d35d4c83a80","permalink":"/2018/12/log-linear-regression-r-downloads/","publishdate":"2018-12-01T00:00:00Z","summary":"1 Summary 2 Question 3 Dataset description 4 The relationship between the education index and R downloads 5 Results 6 Conclusion   1 Summary To see the all the code used in this post, visit my GitHub repository for this site\n Objectives: To understand what factors contribute to R downloads per 1,000 capita. Challenge: Interpretation of log-linear coefficients. Data points: 11,806,912 Language: R   2 Question In a previous post I had looked at which countries downloaded R the most.","tags":["Kaggle","Tidy Tuesday","EDA","Maps"],"title":"Log-linear regression: who tends to download R software"},{"categories":[],"date":1547769600,"description":"This is why despite knowing little to nothing about basketball, I still knew who Lebron James was. In this post I analysed 6,798,209 data points on NBA free throws from 2006 to 2018. I focused on the Players variable to rank NBA players by the total number of shots for all ten seasons and amongst seasons. There is much scoring variability amongst top ten players with some playing less but being scoring more and others attempting much more but being consistent. The better strategy, judging by the ranking, is to attempt more and stay consistent.","expirydate":-62135596800,"objectID":"9d0da175539003988f4882729ec3e576","permalink":"/2019/01/nba-stats/","publishdate":"2019-01-18T00:00:00Z","summary":"1 Summary 2 Question 3 Dataset description 3.1 Who made the most shots between 2006 and 2016? 3.2 Who had the highest shots per free throw attempt between 2006 and 2016? 3.3 Who made the most shots each season? 3.4 What was the free throw attempt between 2006 and 2016 for the player that scored the most each season?  4 Results 5 Conclusion   1 Summary To see the all the code used in this post, visit my GitHub repository for this site","tags":["Kaggle","EDA","NBA"],"title":"NBA free throws analysis"},{"categories":[],"date":1550707200,"description":"In this post I share how I spent my time during my data scientist job search. I then use this information to point out things I would have done differently and things I'm glad I did. The content of this blogpost was first presented at R-Ladies London on 2019-02-21.","expirydate":-62135596800,"objectID":"1bb8b0dfae515e946d7cfc4940203f91","permalink":"/2019/02/data-science-interviews/","publishdate":"2019-02-21T00:00:00Z","summary":"1 Summary 2 Why? 3 Here’s how I spent my time 3.1 Adapting CVs 3.2 Face-to-face interviews 3.3 Filling out forms 3.4 Interview prep 3.5 Job admin 3.6 Phone calls 3.7 Writing cover letters  4 What would I have done differently? 4.1 Establish healthy boundaries with recruiters 4.2 Focus on the basics for technical test prep 4.3 Schedule interviews at favourable times 4.4 Rehearse not knowing, or being wrong, and feeling embarrassed/nervous/uncomfortable and STILL speaking with confidence  5 What would I do again?","tags":["Reflection","Data science interviews","R-Ladies London"],"title":"Data science interviews: lessons learned"},{"date":1550707200,"expirydate":-62135596800,"objectID":"20cb54381cc522e5bfc375a16dbe1877","permalink":"/post/","publishdate":"0001-01-01T00:00:00Z","summary":" 2019 February Data science interviews: lessons learned\n January NBA free throws analysis\n  2018 December Log-linear regression: who tends to download R software\n November Maps: R-Downloads around the world\n October Clustering: cereals, supermarket shelves, and sugar\n September Regression trees: predicting property prices\n August Exploring Kiva loans\n  ","title":"Posts"},{"date":-62135596800,"expirydate":-62135596800,"objectID":"ef53d7c76d723862b849117cf2bce593","permalink":"/presentations/","publishdate":"0001-01-01T00:00:00Z","summary":" 2019 2019-02-21: Data science interviews presented at R-Ladies London\n ","title":"Presentations"}]