[{"date":1543622400,"expirydate":-62135596800,"objectID":"d41d8cd98f00b204e9800998ecf8427e","permalink":"/","publishdate":"0001-01-01T00:00:00Z","summary":"","title":"Ángela Castillo-Gill"},{"date":-62135596800,"expirydate":-62135596800,"objectID":"5fd7ddd1047983500df87840bde5a564","permalink":"/about/","publishdate":"0001-01-01T00:00:00Z","summary":"😕\n🕵","title":"About"},{"categories":[],"date":1530921600,"description":"In this post I analyse 671,205 Kiva loans. I find that the gender that requests the most loans is female with single females being the most frequent borrowers. The main uses for these loans are agriculture, retail, and food with some variations amongst regions. Half of the loans are 4.22 USD or less and are funded by 12 or less contributers. The median time between posting a loan online and disbursing it to the borrower is 16.89 days. I mainly use the tidyverse, stringr, and quantmode packages.","expirydate":-62135596800,"objectID":"41429b3fa65e9e188171ee8bdc0f02eb","permalink":"/2018/07/exploring-kiva-loans/","publishdate":"2018-07-07T00:00:00Z","summary":"1 Summary 2 Purpose of this post 3 The data 4 Data cleaning 5 Exploratory data analysis 6 Techniques used 7 Questions from this analysis   1 Summary To see the code used in this post, visit my kernel on kaggle in R Markdown format.\nIn this post I analyse 671,205 Kiva loans. I find that the gender that requests the most loans is female with single females being the most frequent borrowers.","tags":["Kaggle","Kiva","End-to-end","Exploratory data analysis"],"title":"Exploring Kiva loans"},{"categories":[],"date":1533772800,"description":"In this post I explore a property dataset from Ames, Iowa. The data describes a set of features for houses. My goal was to understand what characteristics make a house more valuable than others in Ames, Iowa.","expirydate":-62135596800,"objectID":"58b1c36adbb58e860f9c6ec655a1a5a5","permalink":"/2018/08/regression-trees-predicting-property-prices/","publishdate":"2018-08-09T00:00:00Z","summary":"1 Summary 2 Question 3 Dataset description 3.1 Missing values 3.2 Correlation  4 Regression trees - why use them? 4.1 Variable importance  5 Results 6 What does it mean?   1 Summary To see the code used in this post, visit my kernel on kaggle in R Markdown format.\nIn this post I explore a property dataset from Ames, Iowa. The data describes a set of features for houses.","tags":["Kaggle","Home sales prices","Decision trees","Regression trees"],"title":"Regression trees: predicting property prices"},{"categories":[],"date":1543622400,"description":"Tim I love you but you snore.","expirydate":-62135596800,"objectID":"3185314ddac5fe9bc55d41a84a9f68c7","permalink":"/2018/12/linear-regression-r-downloads-around-the-world/","publishdate":"2018-12-01T00:00:00Z","summary":"1 Summary 2 Question 3 Dataset description 3.1 Top 10 countries for R Downloads  4 Linear regression - why use it? 5 Results 6 What does it mean?   1 Summary To see the code used in this post, visit my kernel on kaggle in R Markdown format.\nWrite up\n 2 Question What countries download R the most? Where are they? And who are the most intense R users measured by R downloads per capita?","tags":["Kaggle","Tidy Tuesday","Linear regression"],"title":"Linear regression: R-Downloads around the world"}]