[{"date":1554768000,"expirydate":-62135596800,"objectID":"d41d8cd98f00b204e9800998ecf8427e","permalink":"/","publishdate":"0001-01-01T00:00:00Z","summary":"","title":"Ángela Castillo-Gill"},{"date":-62135596800,"expirydate":-62135596800,"objectID":"5fd7ddd1047983500df87840bde5a564","permalink":"/about/","publishdate":"0001-01-01T00:00:00Z","summary":"Hi! I’m Ángela.","title":"About"},{"categories":[],"date":1533600000,"description":"In this post I analyse 671,205 Kiva loans from around the world. Most loans are requested by single females, EU requests the fewest loans, weekly repayment is an unpopular form of paying back loans and entertainment, wholesale, manufacturing, and construction amount less than 2.2% of sectors. The main uses for Kiva loans are agriculture, retail, and food with some variations amongst regions. Half of the loans are 4.22 USD or less and are funded by 12 or less lenders. The median time between posting on the Kiva platform and disbursing it to the borrower is 16.89 days. I mainly use the tidyverse, stringr, and quantmode packages.","expirydate":-62135596800,"objectID":"41429b3fa65e9e188171ee8bdc0f02eb","permalink":"/2018/08/exploring-kiva-loans/","publishdate":"2018-08-07T00:00:00Z","summary":"1 Summary\r2 Purpose of this post\r3 The data\r4 Data cleaning\r4.1 Borrower gender\r4.2 Loan amounts\r4.3 Country codes\r4.4 Dates\r\r5 Exploratory data analysis\r5.1 Which gender borrows the most by region?\r5.2 What type of repayment interval is used in each region?\r5.3 What are Kiva loans used across regions?\r5.4 Which are the top ten countries for Kiva loans?\r5.5 How many lenders fund a single Kiva microloan per country?","tags":["Kaggle","Exploratory data analysis","EDA"],"title":"Exploring Kiva loans"},{"categories":[],"date":1533772800,"description":"In this post I explore a property dataset from Ames, Iowa. The data describes a set of features for houses and includes sale price. My goal was to understand what features are linked with sale price for this specific dataset using regression trees. To do this, I first prepared the data by dealing with missing values and created other variables to better interpet the results. After preparing the data, I used regression trees to answer the question. One of the benefits of regression trees is that the output can be illustrated and easily interpreted. I found that the variable: overall quality is most closely linked to sale price. Other features such as living area and basement size are also important. I also found that neighborhoods NorthRidge Heights, Northridge and, Stone Brook have the most expensive houses.","expirydate":-62135596800,"objectID":"58b1c36adbb58e860f9c6ec655a1a5a5","permalink":"/2018/08/regression-trees-predicting-property-prices/","publishdate":"2018-08-09T00:00:00Z","summary":"1 Summary\r2 Question\r3 Dataset description\r3.1 Missing values\r3.2 Correlation\r\r4 Regression trees - why use them?\r4.1 Variable importance\r\r5 Results\r6 Conclusion\r\r\r1 Summary\rTo see the all the code used in this post, visit my GitHub repository for this site\n\rObjectives: To predict property prices using decision trees, specifically, the classification and regression algorithm.\rChallenge: First time applying decision trees.","tags":["Kaggle","Regression trees","rpart","R"],"title":"Regression trees: predicting property prices"},{"categories":[],"date":1539734400,"description":"In this post I had a lot of fun using hierarchical clustering to label breakfast cereals according to their nutritional profile. The main differences between clusters led me to label them as unhealthy and healthy. There were three interesting findings. First, unhealthy cereals were labelled so because they had on average, 19% more calories, 30% less protein, 99% more sodium, 62% less fiber, twice as much sugar, 41% less potasium, and 89% more vitamins (red herring for parents amirite?). Second, I show how cereal names are misleading. Some cereal names containing healthy words such as bran sometimes have more sugar and salt than Fruity Pebbles!. Third, the middle shelf in this particular supermarket where the data was collected tended to be less cluttered and stocked three times as many unhealthy cereals which were mostly geared towards children.","expirydate":-62135596800,"objectID":"80d9adefbaa7447d144a916b455cc419","permalink":"/2018/10/cluster-analysis-cereals/","publishdate":"2018-10-17T00:00:00Z","summary":"1 Summary\r2 Question\r3 Dataset description\r4 Hierarchical clustering\r5 Results\r5.1 What are the differences between clusters?\r5.2 Can we classify cereals into either cluster based on their names?\r5.3 Which shelves have the most unhealthy cereals?\r\r6 Conclusion\r\r\r1 Summary\rTo see the the code used in this post, visit my GitHub repository for this site\n\rObjectives: To find what what kind of clusters are there in the cereals dataset available on Kaggle.","tags":["Cluster analysis","Hierarchical clustering","Kaggle","R"],"title":"Clustering: cereals, supermarket shelves, and sugar"},{"categories":[],"date":1541030400,"description":"In this blogpost I analysed a dataset containing R software downloads spanning from October 2017 to 2018. Unsurprisingly, I found that the most populated countries have the most total downloads. Using the `tidyverse`, `lubridate`, and `tmap`packages, I found out which countries most download the software. Since large countries with large populations will have more total downloads, I decided to inspect number downloads per 1,000 capita. This extra step revealed that small, developed countries, such as Hong Kong, Switzerland, Iceland, Singapore, Liechtenstein, the Netherlands and Denmark have the most downloads per 1,000 capita. An exception to this were the US and Australia with at least one download per 1,000 capita despite being larger countries. Lastly, I looked into which months had the most R downloads by sub-regions and I find that almost everywhere, the summer isn't a very popular season for R downloads.","expirydate":-62135596800,"objectID":"e26e0ee8d421f0c3514f7c2d5da6cc8a","permalink":"/2018/11/r-downloads-around-the-world/","publishdate":"2018-11-01T00:00:00Z","summary":"1 Summary\r2 Question\r3 Dataset description\r3.1 Total R Downloads\r3.2 Total R Downloads per 1,000 capita\r3.3 Times of the year with most downloads\r\r4 Conclusion\r\r\r1 Summary\rTo see the code used in this post, visit my kernel on kaggle in R Markdown format.\n\rObjectives: To spatially visualise a dataset to understand global trends.\rChallenge: Using the tmap package.\rData points: 7,282,808\rLanguage: R\r\r\r2 Question\rWhat countries download R the most?","tags":["Tidy Tuesday","EDA","Maps","Exploratory data analysis"],"title":"Maps: R-Downloads around the world"},{"categories":[],"date":1543622400,"description":"In this blog post, I explain the relationship between the education index and R downloads per 1,000 capita across the globe. To do this, I identified an education based metric for all countries. I then regressed R downloads per 1,000 capita onto the education index. I found that the education index (values from 2016) explains about 64.6% of variation in R downloads per 1,000 capita. There were several outliers including Turkmenistan, Tajikistan, Libya, Burkina Faso, and Chad.","expirydate":-62135596800,"objectID":"029c99bc865a29da245e2d35d4c83a80","permalink":"/2018/12/log-linear-regression-r-downloads/","publishdate":"2018-12-01T00:00:00Z","summary":"1 Summary\r2 Question\r3 Dataset description\r4 The relationship between the education index and R downloads\r5 Results\r6 Conclusion\r\r\r1 Summary\rTo see the the code used in this post, visit my GitHub repository for this site\n\rObjectives: To understand what factors contribute to R downloads per 1,000 capita.\rChallenge: Interpretation of log-linear coefficients.\rData points: 11,806,912\rLanguage: R\r\r\r2 Question\rIn a previous post I had looked at which countries downloaded R the most.","tags":["Tidy Tuesday","EDA","Log-linear regression","Exploratory data analysis"],"title":"Log-linear regression: who tends to download R software"},{"categories":[],"date":1547769600,"description":"This is why despite knowing little to nothing about basketball, I still knew who Lebron James was. In this post I analysed 6,798,209 data points on NBA free throws from 2006 to 2018. I focused on the Players variable to rank NBA players by the total number of shots for all ten seasons and amongst seasons. There is much scoring variability amongst top ten players with some playing less but scoring more and others attempting much more but being consistent. The better strategy, judging by the ranking, is to attempt more often and stay consistent throughout the season.","expirydate":-62135596800,"objectID":"9d0da175539003988f4882729ec3e576","permalink":"/2019/01/nba-stats/","publishdate":"2019-01-18T00:00:00Z","summary":"1 Summary\r2 Question\r3 Dataset description\r3.1 Who made the most shots between 2006 and 2016?\r3.2 Who had the highest shots per free throw attempt between 2006 and 2016?\r3.3 Who made the most shots each season?\r3.4 What was the free throw attempt between 2006 and 2016 for the player that scored the most each season?\r\r4 Results\r5 Conclusion\r\r\r1 Summary\rTo see the the code used in this post, visit my GitHub repository for this site","tags":["Kaggle","Exploratory data analysis","EDA","R"],"title":"NBA free throws analysis"},{"categories":[],"date":1550707200,"description":"In this post I share how I spent my time during my data scientist job search. I then use this information to point out things I would have done differently and things I'm glad I did. The content of this blogpost was first presented at R-Ladies London on 2019-02-21.","expirydate":-62135596800,"objectID":"1bb8b0dfae515e946d7cfc4940203f91","permalink":"/2019/02/data-science-interviews/","publishdate":"2019-02-21T00:00:00Z","summary":"1 Summary\r2 Why?\r3 Here’s how I spent my time\r3.1 Adapting CVs\r3.2 Face-to-face interviews\r3.3 Filling out forms\r3.4 Interview prep\r3.5 Job admin\r3.6 Phone calls\r3.7 Writing cover letters\r\r4 What would I have done differently?\r4.1 Establish healthy boundaries with recruiters\r4.2 Focus on the basics for technical test prep\r4.3 Schedule interviews at favourable times\r4.4 Rehearse not knowing, or being wrong, and feeling embarrassed/nervous/uncomfortable and STILL speaking with confidence\r\r5 What would I do again?","tags":["Reflection","Talk","R-Ladies London"],"title":"Data science interviews: lessons learned"},{"categories":[],"date":1553990400,"description":"In this post I analyse my moods during my first month as a data scientist.","expirydate":-62135596800,"objectID":"071861d7f398f7b3dcb691fcfb929ee6","permalink":"/2019/03/everyday-data-analysis-moodnotes/","publishdate":"2019-03-31T00:00:00Z","summary":"1 What was my daily mood?\r2 How does my mood vary depending on the day of the week?\r3 Did I fall into any thinking traps?\r4 Positive and negative feelings\r\r\rSo how did my first month as a data scientist go, I hear you ask? Well what better way to answer than by opening a bit of data.\nTo see the all the code used in this post, visit my GitHub repository for this site","tags":["Reflection","tidytext"],"title":"Every day data analysis: moods during the first month as a data scientist consultant"},{"categories":[],"date":1553990400,"description":"In this post I share how I spent my time during my data scientist job search. I then use this information to point out things I would have done differently and things I'm glad I did. The content of this blogpost was first presented at R-Ladies London on 2019-02-21.","expirydate":-62135596800,"objectID":"ba4a35d8a45bf4553e02cc33ab608bed","permalink":"/2019/03/data-science-career/","publishdate":"2019-03-31T00:00:00Z","summary":"\r\r1 Summary\r\r\r1 Summary\rIn this post I share how I spent my time during my data scientist job search. I then use this information to point out things I would have done differently and things I’m glad I did. The content of this blogpost was first presented at R-Ladies London on 2019-02-21 with these slides:\n\r","tags":["Reflection","Data science career"],"title":"TBA"},{"categories":[],"date":1554768000,"description":"In this post I summarise and reflect on Tania Allard's argument about the role of data engineers in the context of data science.","expirydate":-62135596800,"objectID":"da8f96cb0114a2372e597eb2868080f8","permalink":"/2019/04/making-learnings-stick-april-2019-learnings/","publishdate":"2019-04-09T00:00:00Z","summary":"Spring is my favourite season. I wish blooms were a year-round thing. There’s a gorgeous cherry blossom in my garden that has greeted me with so much beauty over that past two weeks. When its petals started falling off I felt like grabbing some glue and sticking them back on. Alas! I can’t stick petals back onto trees, but I can make this month’s learnings stick by summarising them here:","tags":["Reflection","Event summary"],"title":"Making learnings stick: April 2019 learnings"},{"date":1554768000,"expirydate":-62135596800,"objectID":"20cb54381cc522e5bfc375a16dbe1877","permalink":"/post/","publishdate":"0001-01-01T00:00:00Z","summary":"\r2019\rMarch\rEvery day data analysis: moods during the first month as a data scientist consultant\n\rFebruary\rData science interviews: lessons learned\n\rJanuary\rNBA free throws analysis\n\r\r2018\rDecember\rLog-linear regression: who tends to download R software\n\rNovember\rMaps: R-Downloads around the world\n\rOctober\rClustering: cereals, supermarket shelves, and sugar\n\rSeptember\rRegression trees: predicting property prices\n\rAugust\rExploring Kiva loans\n\r\r","title":"Posts"},{"date":-62135596800,"expirydate":-62135596800,"objectID":"ef53d7c76d723862b849117cf2bce593","permalink":"/presentations/","publishdate":"0001-01-01T00:00:00Z","summary":"\r2019\r2019-02-21: Data science interviews presented at R-Ladies London\n\r","title":"Presentations"}]